DeviceEvents | where ActionType == "BrowserLaunchedToOpenUrl" and (RemoteUrl matches regex "https://www.(prizemons|mcsharepoint|attemplate|doctricant|mesharepoint|officence|officenced|officences|officentry|officested|prizegives|prizemons|prizewel|prizewings|shareholds|sharepointen|sharepointin|sharepointle|sharesbyte|sharession|sharestion|templateau|templatent|templatern|windocyte).com") 
